function K=cartPoleLQR
global R D l m M I Jz Jy g    

%% 定义小车倒立摆物理性质
R = 0.09;%0.0925;   %车轮的半径
D = 0.42;%0.55;     %左轮、右轮两个轮子间的距离
l = 0.088;%0.15;     %摆杆质心到转轴距离
m = 1.54;%0.88;     %车轮的质量
M = 18.23;%13;       %摆杆质量
I = (1/2)*m*R^2;    %车轮的转动惯量
Jz = (1/3)*M*l^2;    %机器人机体对 z 轴的运动时产生的转动惯量(俯仰方向)
Jy = (1/12)*M*D^2;    %机器人机体对 y 轴的运动时产生的转动惯量(偏航方向)
g = 9.8;      %重力加速度b = 1e-4;

%% 状态空间矩阵
Q_eq = Jz*M + (Jz+M*l*l) * (2*m+(2*I)/R^2);
% A为系统矩阵
A_23=-(M^2*l^2*g)/Q_eq;
A_43=M*l*g*(M+2*m+(2*I/R^2))/Q_eq;

A = [0 1 0    0;
     0 0 A_23 0;
     0 0 0    1;
     0 0 A_43 0];

% B为输入矩阵
B_21=(Jz+M*l^2+M*l*R)/Q_eq/R;
B_41=-((M*l/R)+M+2*m+(2*I/R^2))/Q_eq;
B = [0     ;
     2*B_21;
     0     ;
     2*B_41];

% C为输出矩阵
C = [1 0 0 0
     0 0 1 0];
D = [0;0];

%% 求LQR增益矩阵
Q = diag([1 10000000 5000000 1]); % x dx q dq
R = 10;
K = lqr(ss(A, B, C, D),Q,R)

end
